Catalogs/СтатьиБюджета.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.5">
	<Catalog>
		<Properties>
			<Name>СтатьиБюджета</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Коэффициент</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1024</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МоделиСтр</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

InformationRegisters/ЗапросыДДС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.5">
	<InformationRegister>
		<Properties>
			<Name>ЗапросыДДС</Name>
			<Comment>если не указано значит факт</Comment>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ТекстЗапроса</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТекстЗапросаРасшифровки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТекстЗапросаСсылка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТекстыЗапросов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТекстЗапросаРасшифровкиСсылка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТекстыЗапросов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Параметры</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Статья</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатьиБюджета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Сценарий</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СценарииПланирования</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Catalogs/СтатьиБюджета/Forms/ФормаСписка/Ext/Form/Module.bsl
&НаСервере
Процедура ОбновитьФильтрПоМоделям()
	
	ОтмМодели = КонвертацияТипов.ПолучитьОтмеченныеЗначенияСписка(Модели);
	
	Список.Параметры.УстановитьЗначениеПараметра("ФильтрПоМоделям", Булево(ОтмМодели.Количество()));
	Список.Параметры.УстановитьЗначениеПараметра("Модели", 			ОтмМодели);
	
КонецПроцедуры

&НаКлиенте
Процедура МоделиПриИзменении(Элемент)
	
	ОбновитьФильтрПоМоделям();
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Список.Параметры.УстановитьЗначениеПараметра("ПустойТекст", Справочники.ТекстыЗапросов.ПустаяСсылка());
	
	ОбновитьФильтрПоМоделям();
	
	Запрос = Новый Запрос("ВЫБРАТЬ РАЗРЕШЕННЫЕ Ссылка ИЗ Справочник.МоделиБюджетов ГДЕ НЕ ПометкаУдаления УПОРЯДОЧИТЬ ПО Наименование");
	Запрос.Выполнить().Выгрузить();
	Модели.ЗагрузитьЗначения(Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка"));
	
КонецПроцедуры

&НаКлиенте
Процедура МоделиВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ПоказатьЗначение(,Модели.НайтиПоИдентификатору(ВыбраннаяСтрока).Значение);
	
КонецПроцедуры

&НаСервере
Процедура ПрочитатьРеквизитыСтатьи(СтатьяСсылка)
	
	Настройки = Бюджетирование.ПолучитьНастройкиЗапросаПолностью(СтатьяСсылка, Справочники.СценарииПланирования.Факт);
	
	Если Настройки = Неопределено Тогда
		ТекстЗапроса 			= "";
		ТекстРасшифровки		= "";
		ТекстЗапросаСсылка 		= Справочники.ТекстыЗапросов.ПустаяСсылка();
		ТекстРасшифровкиСсылка 	= Справочники.ТекстыЗапросов.ПустаяСсылка();
	Иначе
		ЗаполнитьЗначенияСвойств(ЭтаФорма, Настройки);
	КонецЕсли;
	
КонецПроцедуры
&НаКлиенте
Процедура СписокПриАктивизацииСтроки(Элемент)
	
	ПрочитатьРеквизитыСтатьи(Элементы.Список.ТекущаяСтрока);
	
КонецПроцедуры

&НаСервере
Процедура СохранитьРеквизитЗапросСтатьи(ИмяРеквизита, Значение, Статья)
	
	Если Статья <> Неопределено Тогда
		
		Запись = РегистрыСведений.ЗапросыДДС.СоздатьМенеджерЗаписи();
		Запись.Статья = Статья;
		Запись.Сценарий = Справочники.СценарииПланирования.Факт;
		
		Запись.Прочитать();
		Запись[ИмяРеквизита] = Значение;
		
		Запись.Записать();
		
	КонецЕсли;
	
КонецПроцедуры
&НаКлиенте
Процедура ТекстЗапросаСсылкаПриИзменении(Элемент)
	
	СохранитьРеквизитЗапросСтатьи("ТекстЗапросаСсылка", ТекстЗапросаСсылка, Элементы.Список.ТекущаяСтрока);
	
КонецПроцедуры
&НаКлиенте
Процедура ТекстЗапросаПриИзменении(Элемент)
	
	СохранитьРеквизитЗапросСтатьи("ТекстЗапроса", ТекстЗапроса, Элементы.Список.ТекущаяСтрока);
	
КонецПроцедуры
&НаКлиенте
Процедура ТекстЗапросаСсылкаРасшифровкаПриИзменении(Элемент)
	
	СохранитьРеквизитЗапросСтатьи("ТекстЗапросаРасшифровкиСсылка", ТекстРасшифровкиСсылка, Элементы.Список.ТекущаяСтрока);
	
КонецПроцедуры
&НаКлиенте
Процедура ТекстЗапросаРасшифровкиПриИзменении(Элемент)
	
	СохранитьРеквизитЗапросСтатьи("ТекстЗапросаРасшифровки", ТекстРасшифровки, Элементы.Список.ТекущаяСтрока);
	
КонецПроцедуры
